{"podcast_details": {"podcast_title": "The Anthropocene Reviewed", "episode_title": "Orbital Sunrise", "episode_image": "https://image.simplecastcdn.com/images/d48cf57e-8709-499d-a9c6-1c6264aff730/d7543167-91d7-455a-9048-b1843e740206/3000x3000/tar-complexly.jpg?aid=rss_feed", "episode_transcript": " Hello and welcome to The Anthropocene Reviewed, a podcast where we review different facets of the human-centered planet on a five-star scale. I'm John Green, and today marks the last episode in our mini-series to celebrate The Anthropocene Reviewed book, which, thanks to your astonishing support, has been on the New York Times bestseller list for eight consecutive weeks now. I am so grateful to everyone who has read it, and for all your kind messages. To cite just one example, a listener named Madeline recently wrote me to say that she and six friends were reading a single copy in turn, with each of them writing notes in the margins about the book and each other. I remember sharing a copy of a Michael Shaben book similarly with friends when I was young, and so that meant a lot to me. Anyway, thank you for reading it and sharing it. There are still signed copies of The Anthropocene Reviewed book available online and at many bookstores, so if you haven't picked one up, now's the time. Alright, on to the episode. Today I'll be reviewing something I've never seen, and never will. An orbital sunrise. Some of you may know that my wife, Sarah Jurist Green, is a curator and writer. Her most recent book, You Are an Artist, features creativity prompts sprinkled with art historical context, and I often use the book when trying to figure out what to write about, or even what to think about. One of the chapters in the book is called Never Seen, Never Will, and it features a prompt from the artist David Brooks, who asks us to think of something we've never seen, and probably never will see, and then to find a way to articulate that something. In this context, Brooks discusses a 1515 etching of a rhinoceros by the artist Albrecht Dürer. Dürer had never seen, and as it happened, would never see, an actual rhinoceros, but he'd read a description of a rhino that had been brought to Portugal in 1510. That rhinoceros went on to die in a shipwreck off the coast of Italy, but using the description and a small sketch, Dürer created a very famous image of a rhino, which depicts the animal as having literal plates of armor, complete with rivets. Dürer's etching does look quite a bit like an actual rhinoceros, which is a testament to his particular genius, and more broadly to the capacities of the human imagination. But in the places where Dürer's rhino is different from an actual one, something else is betrayed about the human imagination, which is that we tend to fill in blank spaces or unknowns with guesses that are deeply shaped by our humanness. When Dürer read that the rhino had skin-like armor, he imagined 16th century European human armor. Because what else could he imagine? When thinking about what to write, or even what to think, my default setting is to focus on what I know, or at least what someone else knows that I can easily learn. And of course, we do know quite a lot about ourselves and the universe. We know about gravity and the structure of DNA, and we know when the Prophet Muhammad led the Muslim community from Mecca to Medina, and we know how internal combustion engines work and the approximate shape of the coastline of Florida. But the truth is, we don't know almost everything. We don't know what dark matter is, or why there is matter in the universe at all. We don't know why agriculture developed, or why it emerged independently in different human communities that couldn't possibly have known about each other. We don't know how thought works, or why some viruses are seasonal. We know almost nothing about the so-called known universe, including how or if it will end or whether it is the only universe, and we don't know who killed Jimmy Hoffa, and we don't know when people started to have names, or what the earliest names were. We also don't know why we make art. Faulkner said that the work of an artist is to create out of the materials of the human spirit something which did not exist before. But it also involves creating out of the materials of the earth something which did not exist before, turning graphite into a drawing, or marble into a sculpture, or sound waves into a podcast. This refashioning is a very old human habit, of course. It is not too distant from tool-making, and indeed it may be that art is a kind of a tool for us, a way into giving form for all the stuff that doesn't easily lend itself to form. But I think even that broad definition is in the end too narrow. I don't know what art is. I don't know why we make it. I don't know almost everything. I think this is what I find so helpful about the Never Seen, Never Will exercise. It reminds me that we don't know almost everything, and that I have never seen and will never see almost everything. Which brings us, belatedly, to the orbital sunrise. During the 342 days that astronaut Scott Kelly spent in space in 2015 and 2016, the International Space Station experienced nearly 11,000 sunrises, because the station orbits Earth every 90 minutes, and with each orbit there is a new sunrise, the sun emerging from behind what looks like a long, thin arc of blue light. That blue light is the crust of the Earth, the only home for almost all of us. During these orbital sunrises, astronauts can sometimes see other bands of color, white, amber, gold, and to hear astronauts talk of orbital sunrises is to glimpse how amazing they must be. The American astronaut Victor Glover wrote of the bands of color, they remind me of the scripture in Psalm 30, weeping may endure for a night, but joy cometh in the morning. Many space travelers have written of experiencing so-called orbital perspective, seeing the whole profoundly interconnected planet from afar, teeming with life, vast and resilient, and fragile and tiny. Astronaut May Jemison said that in space, quote, I felt more expansive, very connected to the universe. The Russian cosmonaut Alexei Leonov wrote that looking back at our blue globe from such a distance profoundly changed my vision of space and time. Leonov is most remembered today for taking the first spacewalk, but he also made the first space art. In March of 1965, when he was 30 years old, Leonov visited space with his friend and colleague Pasha Belayev. The two men orbited the earth in a tiny spherical spacecraft that was just over two meters in diameter, and so they were only allowed a few personal belongings on the trip. Leonov chose to bring a drawing pad and some colored pencils. He loved making art since childhood. He wanted to go to art school, but it was too expensive, so he became a pilot. Their mission was known as Voskhod 2. Voskhod means sunrise in Russian. And despite lasting for just over one day, this spaceflight contained quite a lot of firsts, not just the first spacewalk and the first art made in space, but also the first spacecraft landing to occur 1500 miles off course after its occupants nearly died on several separate occasions. The launch went quite well, and shortly after entering orbit, Leonov, wearing a spacesuit, exited the Voskhod capsule via an airlock and floated in space, connected to the spaceship only by a tether. The event was broadcast live on Soviet radio and television, and you can still see it on YouTube. Watching it recently from the immense comfort of my living room in Indianapolis, I watched Leonov push away from the spacecraft, drifting into the void, until his tether snaps taut. After the break, we'll turn our attention to a series of unfortunate events. But first... After only a few minutes of spacewalking, it was time for Leonov to re-enter the spaceship, dressed he run low on oxygen. But there was a problem. His pressurized suit had dramatically expanded in the vacuum of space. In his memoirs, Leonov recalled, My feet had pulled away from my boots and my fingers from the gloves attached to my sleeves, making it impossible to enter the airlock. The only solution was to reduce the pressure in my suit by opening the pressure valve and letting out a little oxygen at a time as I tried to inch inside the airlock. And so, as his oxygen supply leached out into the void, Leonov tried to wedge himself back into the capsule, which he described as an almost impossible maneuver. This was not broadcast live on television. As Leonov put it, From the moment our mission looked to be in jeopardy, transmissions from our spacecraft were suddenly suspended without explanation. In their place, Mozart's Requiem was played again and again on state radio. The custom in the Soviet Union at the time was for such solemn music to be played after a senior political figure had died, but before an official announcement of their death was made. Leonov's family and friends, who of course knew what the music might mean, waited for the news, with no way of knowing what was happening miles above. As his suit shrank and his oxygen dwindled, Leonov eventually managed to get back into the Voskhod capsule. He was drenched with sweat, breathless, and overwhelmed with adrenaline. His compatriot Pasha calmed him down, saying that they had 90 minutes before they needed to eject the airlock. Maybe Alexei could use that time to rest or to write up a report of the spacewalk. But Leonov found that he could neither sleep nor write. Instead, to calm himself and capture the moment, he took those minutes to make some art. I reached for my sketch pad and colored pencils, and sat quietly drawing my first impressions of the panorama I had seen while floating free in space. I tried to capture the different shades of charcoal rings that make up the Earth's atmosphere, the sunrise or air glow over the Earth's horizon, the blue belt covering the Earth's crust, and the spectrum of colors I had observed looking down at the globe. The sketch is simple. It was made quickly in a weightless environment with simple drawing instruments by a person who had just narrowly survived a spacewalk. But it is also stunningly beautiful. A curved band mixing black and blue represents the portion of the Earth visible due to the rising sun, and then above the Earth a narrow curvature of red, then yellow, and then the black of space. And in the center of the drawing, we see the red sphere of the sun, almost risen behind the curvature of the Earth. It says something to me that the first art made by humans from outside of Earth's atmosphere depicts Earth's atmosphere. Leonov was astonished by the brightness of the stars from space, but he did not draw that, nor did he draw himself floating, looking up at the spaceship. He drew home. He drew what Mary Oliver memorably called this, the one world we all belong to. I will never see an orbital sunrise in real life. On many levels, I'm not cut out for space travel. An inner ear disorder has damaged my sense of balance, for starters. But also, I'm not a pilot, or an engineer, or a billionaire. I tend to side with Eudora Welty on matters of adventure, who once, after acknowledging that she had led a sheltered life, added, \"...a sheltered life can be a daring life as well, for all serious daring starts from within.\" My daring also generally ends within. And so, I will only ever have descriptions and depictions of space, like Albrecht Dürer and his Rhinoceros. When it comes to orbital sunrises, I am wholly dependent upon the words and images of others. But unlike Dürer, I can find endless images and videos of an orbital sunrise via a quick Google search. I can read orbital sunrise musings written by dozens of first-hand observers. But Alexei Leonov's drawing, simple, straightforward, even childlike, is overwhelmingly the most beautiful and moving depiction of an orbital sunrise I've ever seen. Precisely because it is not photorealistic, it captures the awe of that moment, of seeing the sunrise over a very different sort of horizon. After making his sketch of the orbital sunrise, Leonov returned to the business of space travel. And when he and Belayev ejected the airlock, it led to an unexpected and uncontrolled spin of their spaceship. There was no longer the pleasure of a sunrise every 90 minutes. Now their spacecraft was spinning wildly, with the sunlight streaming in through the only window, creating a strobe light effect. On the ground, Mozart's Requiem played over and over on the radio, while in space the oxygen level inside the Voskhod crept dangerously high, so that any spark risked a massive explosion. That problem eventually resolved, but was immediately replaced by another one. The automatic guidance system of the craft failed, which meant the cosmonauts would have to manually choose a landing site and calculate the exact timing and length of the firing of their retro rockets to re-enter Earth's atmosphere. Leonov couldn't navigate toward the original landing site, so after extensive calculations, he chose a site 1500 miles to the west, in a vast wilderness. That way, if they crashed, they at least wouldn't kill anyone on the ground. The crises did not end there. Upon re-entry, the landing module initially failed to separate from the rest of the aircraft as planned, which caused the entire spacecraft to spin as it re-entered the atmosphere. The g-forces were so strong that blood vessels burst in the cosmonauts' eyes. Finally, the landing module did separate, and fortunately the parachutes deployed as planned, and the cosmonauts returned to Earth. They landed in a forest, in two feet of snow, with their escape hatch blocked by a tree that had fallen as the spacecraft barreled into it. The two cosmonauts rocked the capsule back and forth from within for hours to free the escape hatch, and then they spent a very long and very cold night in the Siberian wilderness before rescuers arrived the next day. At last, they skied nine kilometers with a rescue party to a site where a helicopter could land. And that is how the cosmonauts of Voskhod-2 survived, and with them the first picture of an orbital sunrise. I like to look at Leonov's drawing when I am feeling exhausted by despair and drudgery, or when I feel the weight of longing and fear pressing in on my chest. I look at the picture and think of all that had to happen for that drawing to exist, for Leonov to exist, for anything to exist. I look at the drawing and take a long, slow breath and think of how my lungs were made for this air. For me, art is a kind of landing site in the wilderness. Art is where I go when I do not know where else to go, because it can help me to see what I will never see. Not just orbital sunrises, but the way down stuff to abstract and nebulous to have a name. Through art, paradoxes of consciousness resolve for me. I see what I will never see. I know what I will never know. And I survive what I will not survive. I will never see an orbital sunrise, but thanks to Alexei Leonov, I can feel the wonder and consolation of it nonetheless. I give orbital sunrises five stars. Thanks for listening to The Anthropocene Reviewed, which was written by me, edited by Stan Muller, and produced by Rosiana Hals-Rohas. Hannes Brown makes the music. Special thanks to Sarah Jurist Green, whose book You Are an Artist has helped so many people, including this one, come into deeper touch with their creative impulses. Thanks also to David Brooks for sharing the Never Seen, Never Will art assignment. I'm also indebted to the dual memoir Two Sides of the Moon, which Alexei Leonov wrote with the American astronaut David Scott. In 1975, Leonov went to space again, this time to lead a mission in which the Soviet Soyuz spaceship docked with an American Apollo spaceship. As the capsules opened, Leonov shook hands with the American astronaut Thomas Stafford. The two remained friends for nearly 45 years until Leonov's death in 2019. I want to leave you today with some sound from that first meeting of American and Soviet astronauts in space, a moment of hope and camaraderie and shared human endeavor. Thanks for being here with us. May our joint work in space serve for the benefit of all countries and peoples on the Earth farm."}, "podcast_summary": "In this episode of The Anthropocene Reviewed, host John Green reviews the concept of an orbital sunrise, something he has never seen and never will. He discusses the idea of not knowing everything and how the human imagination tends to fill in gaps with familiar or guessed information. Green shares the story of Albrecht Dürer's famous rhinoceros etching, which was based on a description and sketch of a rhino he had never seen. He then delves into the unknowns of the universe and the mysteries of art. Green explores the experiences of astronauts witnessing orbital sunrises and their perspectives of Earth from space. He describes the first space art created by Russian cosmonaut Alexei Leonov and how his drawing of an orbital sunrise captures the beauty and awe of the moment. Despite not being able to see an orbital sunrise himself, Green finds solace and inspiration in Leonov's artwork and the wonder it represents. He concludes by giving orbital sunrises a five-star rating.", "podcast_guest": "Scott Kelly", "podcast_highlights": "Welcome to The Anthropocene Reviewed newsletter, where we summarize and review the important aspects of each podcast episode. In this episode, John Green reviews something he's never seen and never will: an orbital sunrise. \n\nJohn begins by discussing the concept of the \"Never Seen, Never Will\" exercise, inspired by artist David Brooks, who prompts us to think of something we've never seen and find a way to articulate it. He then reflects on the limitations of human knowledge, acknowledging that while we know a lot about ourselves and the universe, there is still so much we don't know. \n\nHe delves into the topic of art and its purpose, stating that art is a way for humans to give shape and form to things that don't easily lend themselves to it. He explores the first art made in space by Russian cosmonaut Alexei Leonov, who brought a drawing pad and colored pencils during his space mission. Leonov's drawing of an orbital sunrise captures the awe and beauty of seeing the Earth from space. \n\nJohn shares Leonov's harrowing experience during his spacewalk and subsequent re-entry into Earth's atmosphere. Despite the challenges, Leonov managed to make his drawing of the orbital sunrise, which John finds incredibly moving and inspiring. He reflects on how art serves as a landing site in the wilderness, a place to go when everything else feels overwhelming.\n\nJohn concludes the episode by giving orbital sunrises a five-star rating, expressing his gratitude for art's ability to make us feel and experience things we may never see in person.\n\nThank you for joining us for this newsletter edition of The Anthropocene Reviewed. We hope you found it engaging and insightful. Don't forget to tune in for our next episode."}