{"podcast_details": {"podcast_title": "BrainStuff", "episode_title": "Why Does Yoga Make People Emotional?", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/91c26f87-aa4e-4e61-816b-ae320005be01/image.jpg?t=1684782237&size=Large", "episode_transcript": " Today's episode is brought to you by Rosetta Stone, the language learning program designed to help you build fluency and confidence for real world speaking and reading. It's really flexible. The curriculum comes in short lessons that you can tailor to goals like travel or business. They gave me a trial. I'm starting with Spanish and Japanese, both of which I studied in school and neither of which I've kept up with, and it's really intuitive. So don't put off learning that language. There's no better time than right now to get started. For a very limited time, BrainStuff listeners can get Rosetta Stone's lifetime membership for 40% off. That's $179 for unlimited access to 25 language courses for the rest of your life. Redeem your 40% off now at rosettastone.com slash brainstuff today. Pleasure, intimacy, self love, real reasons to focus on your sexual health and wellness. This includes HIV prevention. The Ebony study is for black women who have decided to receive injectable prep. Injectable prep is approved by the FDA and is an effective method for preventing HIV from sex. Learn more about how the Ebony study seeks to support black women in creating peace of mind around their sexual health at ebonystudyinfo.com. That's E-B-O-N-I studyinfo.com. This episode is brought to you by Express Employment Professionals. Looking for your next job? Express can help. Express Employment Professionals has put more than 10 million people to work in the last 40 years. Express has a wide variety of jobs available in all industries with flexible schedules, competitive pay, and access to a variety of benefits. What are you waiting for? Visit expresspros.com today and let them help you find your next great job. At Express, they never charge a fee to help you find a job. That's expresspros.com. Welcome to Brain Stuff, a production of iHeartRadio. Hey Brain Stuff, Lauren Vogelbaum here. Sometime around the start of the 21st century, mainstream America found out about yoga. Other mind-body disciplines, including acupuncture, chiropractics, and meditation, have gained significant followings here during that time. But yoga's rise was meteoric. In 2003, market data showed that fewer than 2% of US adults practiced it. By 2016, nearly 15% of Americans over the age of 18 were engaged in the discipline, and another 34% were thinking about giving it a try. Yoga is a tough discipline to define. The National Institutes of Health describes it as a meditative movement practice combining physical postures, breathing techniques, and meditation or relaxation. But it's not really something you do, at least not in the way that you do push-ups. It's more of a state of mind. Technically, the highly physical practice that most Westerners think of as yoga is just one of a large body of yogic disciplines, some of which are far more spiritual than sweat inducing. Most scholars trace yoga's roots to ancient Indian religious practices, typically associated with Hinduism. The Sanskrit word yoga means connection. The yoga state is variously defined as relaxed attentiveness, a balance between body and mind, and tranquility. Whatever yoga is to whoever is practicing it, it can facilitate intense emotional release. Many sources cite resting postures, like corpse pose, as common settings for tears. Back bends, which are considered heart openers in yoga, make the list as well. But hip openers, particularly pigeon pose, seem to win the anecdotal vote. If you're unfamiliar, one stage of pigeon pose looks something like a forward split, but the front leg bends and rests on the mat, causing the hip flexor to open. In another variation of the pose, a sleeping pigeon, the upper body folds over that front leg, and the forearms and forehead may rest on the mat in front of the knee. An advanced expression of the pose, called one-legged king pigeon, incorporates a back bend, where the foot of the back leg touches the head. For the article this episode is based on, House Tough Works spoke via email with yoga teacher and mindfulness coach Daniel Schenken. He said, I'm going to make a t-shirt one of these days that says, in pigeon pose, nobody can see you cry. One time I cried in pigeon pose every time I went to class for three months. He explains that he wasn't in pain, he was just deeply sad. House Tough Works also spoke via email with Joseph Lopez, a Denver-based yoga instructor, who said that he's also cried in sleeping pigeon. Quote, for me, it's always the hip openers that trigger emotions the most. I don't always cry, sometimes I get really, really pissed off. Lopez, who has been practicing for 10 years and teaching for seven, thinks it may be a matter of where we store the emotional gunk of feelings that we don't express. He said, I carry my anger in my hips, so when I open them, that's what gets released. That sort of concept is a common take on the phenomenon, which seems to draw from the Eastern philosophy of chakras. There are seven traditional chakras that mark the points in our bodies where energy supposedly flows. In this understanding of wellness, a block in that energy flow can cause physical and psychological damage. The second chakra is linked to emotions and tears and is centered around the pelvis. The idea is that unblocking that chakra by opening the hips could lead to a sudden flood of emotion, something like the unconscious exploding into consciousness. The science has started looking at the effects of yoga on the mind. A March 2017 study found that yoga can ease the symptoms of major depressive disorder, and other research has found that it reduces anxiety and stress and induces feelings of happiness and unity with the world beyond oneself. But science hasn't done much to elucidate the mechanisms responsible for yoga's emotional liberation. HowstuffWorks also spoke via email with Dr. Timothy McCall, who practiced internal medicine before deciding to study and teach yoga therapy full-time. He reports having once cried after performing a series of back bends, but that this phenomenon hasn't been investigated scientifically to the best of his knowledge. One plausible explanation, he says, is simple awareness. Quote, have you ever had the experience, say on the beach or in the middle of the woods, when you get quiet inside and just become part of what's going on around you? Sometimes in that moment, you'll get an epiphany. Maybe you need to quit your job or get out of an unhealthy relationship. This might be something that you've known deep down but have been overlooking during the grind of everyday life, and it can work that way with emotions too. McCall speculated, they may be buried deeply or sometimes just below the surface, yet out of our conscious awareness. When we get quiet and introspective in yoga practice, those emotions might come to the fore. It may be that yoga's focus on conscious breathing, postural alignment, and physical sensations, as well as the interactions between those factors, leaves no room for the noise of daily life. Suddenly, we can hear something deeper. Ultimately, neither science nor yoga practitioners really know why yoga can bring emotions to the surface. Maybe we never will, but we can say that these types of breakthroughs are useful. As a yoga instructor, he tries to let them be. And for many practitioners, part of yoga is letting go of the hows and whys. To this day, Shanken has no idea why he cried in pigeon pose for three months, but that doesn't matter. For him, what matters is that he, quote, finally felt safe enough to go to the toilet. At the end of the three months, the crying stopped on its own, and my hips were much more open as well. Today's episode is based on the article, Yoga Makes People Super Emotional. But why? On HowStuffWorks.com, written by Julia Layton. BrainStuff is production of iHeartRadio in partnership with HowStuffWorks.com and is produced by Tyler Kloss. The show is a production of iHeartRadio, a show that is based on the article, Yoga Makes People Super Emotional. It's a show that is produced by iHeartRadio in partnership with HowStuffWorks.com and is produced by Tyler Klang. For more podcasts from iHeartRadio, visit the iHeartRadio app, Apple podcasts, or wherever you listen to your favorite shows. This episode is brought to you by Express Employment Professionals. Looking for your next job? Express has over 2 million people to work in the last 40 years. Express has a wide variety of jobs available in all industries, with flexible schedules, competitive pay, and access to a variety of benefits. What are you waiting for? Visit ExpressPros.com today and let them help you find your next great job. Express, they never charge a fee to help you find a job. That's ExpressPros.com. Now you can reach for new Clorox Free and Clear products for a clean that's tough and gentle and safe around kids and pets and food when used as directed. Get yours now at Clorox.com. Clorox. Start clean."}, "podcast_summary": "The podcast discusses the emotional aspect of practicing yoga and why it can bring up intense emotions. Yoga is described as a meditative movement practice that combines physical postures, breathing techniques, and meditation or relaxation. While yoga has gained significant popularity in the US over the past few decades, its roots can be traced back to ancient Indian religious practices. The podcast explores the phenomenon of emotional release during yoga, with some practitioners sharing their experiences of crying or feeling intense emotions during specific poses, such as pigeon pose or back bends. Theories suggest that the hip openers in yoga may release emotional gunk stored in the body, according to Eastern philosophy. However, the emotional effects of yoga have not been scientifically studied extensively. Some experts propose that the quiet introspection in yoga practice allows buried or repressed emotions to surface. Ultimately, the reasons behind these emotional breakthroughs are still unknown, but yoga practitioners embrace and value the release of emotions during their practice.", "podcast_guest": "Lauren Vogelbaum", "podcast_highlights": "In today's episode of BrainStuff, Lauren Vogelbaum discusses the emotional aspects of practicing yoga, particularly how it can lead to intense emotional release. Many practitioners have reported experiencing intense emotions, including crying, during certain yoga poses, such as pigeon pose and back bends. While the exact reasons for these emotional releases are not fully understood, some explanations include the release of stored emotions in the hip area, the opening of energy flow in the second chakra, and the quiet and introspective nature of yoga practice, which allows for buried emotions to come to the surface. Despite not having a definitive answer, these emotional breakthroughs are often seen as beneficial for practitioners, as they can provide a sense of release and the opportunity for personal growth. To listen to the full episode, visit the iHeartRadio app or wherever you listen to podcasts."}
